
&НаКлиенте
Процедура Боты(Команда)
	ЗначениеОтбора = Новый Структура("Вид", ПредопределенноеЗначение("Перечисление.док_ВидыБотов.Slack"));
	ПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);
	ОткрытьФорму("Справочник.док_Боты.ФормаСписка",ПараметрыВыбора);
КонецПроцедуры

&НаКлиенте
Процедура ИсторияОтправкиСообщений(Команда)
	ОткрытьФорму("РегистрСведений.Slack_ИсторияСообщений.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ВзаимодействиеС_API(Команда)
	ОткрытьФорму("Обработка.док_SlackConnect.Форма.Форма");
КонецПроцедуры
