
&НаСервере
Процедура ЗаполнитьВерсииИзМассива(МассивВерсий)
	
	Для каждого стр из МассивВерсий Цикл
		стр = СокрЛП(стр);
		Версия = Справочники.док_ВерсииКонфигураций.ПустаяСсылка();
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ВерсииКонфигураций.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.док_ВерсииКонфигураций КАК ВерсииКонфигураций
		|ГДЕ
		|	ВерсииКонфигураций.Наименование = &Версия");
		Запрос.УстановитьПараметр("Версия",стр);
		ЗВ = Запрос.Выполнить();
		Если НЕ ЗВ.Пустой() Тогда
			Таб = ЗВ.Выгрузить();
			Если Таб.Количество()=1 Тогда
				Версия = Таб[0].Ссылка;
			Иначе
				Запрос = Новый запрос("ВЫБРАТЬ
				|	ВерсииКонфигураций.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.док_ВерсииКонфигураций КАК ВерсииКонфигураций
				|ГДЕ
				|	ВерсииКонфигураций.Конфигурация = &Конфигурация
				|	И ВерсииКонфигураций.Наименование = &Версия");
				Запрос.УстановитьПараметр("Версия",стр);
				Запрос.УстановитьПараметр("Конфигурация",Объект.Конфигурация);
				ЗВ = Запрос.Выполнить();
				Если ЗВ.Пустой() Тогда
					Таб = ЗВ.Выгрузить();
					Версия = Таб[0].Ссылка;
				КонецЕсли;	
			КонецЕсли;	
		Конецесли;	
			
		Если НЕ Версия.Пустая() Тогда
			Строка = Объект.ОбновлениеДляВерсий.Добавить();
			Строка.Версия = Версия;
		КонецЕсли;
		
	КонецЦикла;
	
	ТЗ=Объект.ОбновлениеДляВерсий.Выгрузить();
	ТЗ.Свернуть("Версия");
	Объект.ОбновлениеДляВерсий.Загрузить(ТЗ);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеДляВерсийСтрокаПриИзменении(Элемент)
	Если Не Объект.ОбновлениеДляВерсийСтрока = "" Тогда		
		МассивВерсий = СтрРазделить(Объект.ОбновлениеДляВерсийСтрока, ",");
		ЗаполнитьВерсииИзМассива(МассивВерсий);		
	КонецЕсли;
КонецПроцедуры  

