
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(Новый ПараметрВыбора("Отбор.Конфигурация", Объект.Конфигурация));
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);	
	Элементы.ОбновлениеДляВерсий.ПараметрыВыбора = НовыеПараметры;	
	ОбновитьСписокЗначенийОбновлениеДляВерсий();	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокЗначенийОбновлениеДляВерсий()	
	ТЗ = Объект.ОбновлениеДляВерсий.Выгрузить();
	ОбновлениеДляВерсий.ЗагрузитьЗначения(ТЗ.ВыгрузитьКолонку("Версия"));
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВерсииИзСтроки(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьВерсииДляОбновленияСтрокой", ЭтотОбъект);
    ПоказатьВводСтроки(Оповещение,, "Введите версии через запятую",0,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВерсииДляОбновленияСтрокой(Результат, Параметры) Экспорт
 
    Если Не Результат = Неопределено Тогда		
		МассивВерсий = СтрРазделить(Результат, ",");
		ЗаполнитьВерсииИзМассива(МассивВерсий);		
	КонецЕсли;
	 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВерсииИзМассива(МассивВерсий)
	
	ОбновлениеДляВерсий.Очистить();
	
	Для каждого стр из МассивВерсий Цикл
		стр = СокрЛП(стр);
		Версия = Справочники.док_ВерсииКонфигураций.ПустаяСсылка();
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ВерсииКонфигураций.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.док_ВерсииКонфигураций КАК ВерсииКонфигураций
		|ГДЕ
		|	ВерсииКонфигураций.Наименование = &Версия");
		Запрос.УстановитьПараметр("Версия",стр);
		ЗВ = Запрос.Выполнить();
		Если ЗВ.Пустой() Тогда
			Сообщить("Не найдена версия " + стр);
		Иначе
			Таб = ЗВ.Выгрузить();
			Если Таб.Количество()=1 Тогда
				Версия = Таб[0].Ссылка;
			Иначе
				Запрос = Новый запрос("ВЫБРАТЬ
				|	ВерсииКонфигураций.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.док_ВерсииКонфигураций КАК ВерсииКонфигураций
				|ГДЕ
				|	ВерсииКонфигураций.Конфигурация = &Конфигурация
				|	И ВерсииКонфигураций.Наименование = &Версия");
				Запрос.УстановитьПараметр("Версия",стр);
				Запрос.УстановитьПараметр("Конфигурация",Объект.Конфигурация);
				ЗВ = Запрос.Выполнить();
				Если ЗВ.Пустой() Тогда
					Сообщить("Не найдена версия " + стр);
				Иначе
					Таб = ЗВ.Выгрузить();
					Версия = Таб[0].Ссылка;
				КонецЕсли;	
			КонецЕсли;	
		Конецесли;	
			
		Если НЕ Версия.Пустая() Тогда
			ОбновлениеДляВерсий.Добавить(Версия);
		КонецЕсли;
		
	КонецЦикла;	
	
	ЗаполнитьВерсииДляОбновления();
	
КонецПроцедуры


&НаКлиенте
Процедура ОбновлениеДляВерсийПриИзменении(Элемент)
	ЗаполнитьВерсииДляОбновления();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВерсииДляОбновления()	
	Объект.ОбновлениеДляВерсий.Очистить();
	Для каждого стр из ОбновлениеДляВерсий Цикл
		Строка = Объект.ОбновлениеДляВерсий.Добавить();
		Строка.Версия = стр.Значение;
	КонецЦикла;
	СвернутьТабличнуюЧастьНаСервере("ОбновлениеДляВерсий","Версия");
	ОбновитьСписокЗначенийОбновлениеДляВерсий();
	ЭтаФорма.Модифицированность = Истина;	
КонецПроцедуры	

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтаФорма.Модифицированность Тогда
		ОбновлениеДляВерсийСтрока = "";
		Для каждого стр из Объект.ОбновлениеДляВерсий Цикл
			ОбновлениеДляВерсийСтрока = ?(ОбновлениеДляВерсийСтрока="",Строка(стр.Версия),ОбновлениеДляВерсийСтрока + ", " + стр.Версия);
		КонецЦикла;	
		Объект.ОбновлениеДляВерсийСтрока = ОбновлениеДляВерсийСтрока;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеДляВерсийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.док_ВерсииКонфигураций.Форма.ФормаПодбораСпискаЗначений",Новый структура("ТипДанных,Данные,Конфигурация", "док_ВерсииКонфигураций",ОбновлениеДляВерсий.ВыгрузитьЗначения(),Объект.Конфигурация)
	,,,,,Новый ОписаниеОповещения("ЗаполнитьИзФормыПодбораСпискаЗначений",ЭтаФорма,"ОбновлениеДляВерсий"));
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзФормыПодбораСпискаЗначений(Список, Поле) Экспорт 
	Если НЕ Список = Неопределено Тогда
		ЭтаФорма[Поле].ЗагрузитьЗначения(Список);	
		ЗаполнитьВерсииДляОбновления();
	КонецЕсли;
КонецПроцедуры

Процедура СвернутьТабличнуюЧастьНаСервере(ИмяТабличнойЧасти,ИмяСтолбца)
	ТЗ=Объект[ИмяТабличнойЧасти].Выгрузить();
	ТЗ.Свернуть(ИмяСтолбца);
	Объект[ИмяТабличнойЧасти].Загрузить(ТЗ);
КонецПроцедуры
