
Функция Сохранить() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Серверы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Серверы КАК Серверы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Клиенты.Ссылка
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БД.Ссылка
	|ИЗ
	|	Справочник.БД КАК БД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВерсииКонфигураций.Ссылка
	|ИЗ
	|	Справочник.ВерсииКонфигураций КАК ВерсииКонфигураций
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВерсииПлатформы1С.Ссылка
	|ИЗ
	|	Справочник.ВерсииПлатформы1С КАК ВерсииПлатформы1С
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Видеорегистраторы.Ссылка
	|ИЗ
	|	Справочник.Видеорегистраторы КАК Видеорегистраторы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыКомплектующих.Ссылка
	|ИЗ
	|	Справочник.ВидыКомплектующих КАК ВидыКомплектующих
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыУстройств.Ссылка
	|ИЗ
	|	Справочник.ВидыУстройств КАК ВидыУстройств
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Домены.Ссылка
	|ИЗ
	|	Справочник.Домены КАК Домены
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Заметки.Ссылка
	|ИЗ
	|	Справочник.Заметки КАК Заметки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Кассы.Ссылка
	|ИЗ
	|	Справочник.Кассы КАК Кассы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Конфигурации.Ссылка
	|ИЗ
	|	Справочник.Конфигурации КАК Конфигурации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Лицензии.Ссылка
	|ИЗ
	|	Справочник.Лицензии КАК Лицензии
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОперационныеСистемы.Ссылка
	|ИЗ
	|	Справочник.ОперационныеСистемы КАК ОперационныеСистемы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Принтеры.Ссылка
	|ИЗ
	|	Справочник.Принтеры КАК Принтеры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СерверыVPN.Ссылка
	|ИЗ
	|	Справочник.СерверыVPN КАК СерверыVPN
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Сервисы.Ссылка
	|ИЗ
	|	Справочник.Сервисы КАК Сервисы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СетевоеОборудование.Ссылка
	|ИЗ
	|	Справочник.СетевоеОборудование КАК СетевоеОборудование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Сети.Ссылка
	|ИЗ
	|	Справочник.Сети КАК Сети
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СправочникСУБД.Ссылка
	|ИЗ
	|	Справочник.СУБД КАК СправочникСУБД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Устройства.Ссылка
	|ИЗ
	|	Справочник.Устройства КАК Устройства
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УстройстваСУдаленнымУправлением.Ссылка
	|ИЗ
	|	Справочник.УстройстваСУдаленнымУправлением КАК УстройстваСУдаленнымУправлением
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УчетныеДанныеСервисов.Ссылка
	|ИЗ
	|	Справочник.УчетныеДанныеСервисов КАК УчетныеДанныеСервисов");
	Таб = Запрос.Выполнить().Выгрузить();
	МассивСправочниов = Новый Массив;
	Для каждого стр из Таб Цикл
		МассивСправочниов.Добавить(стр.Ссылка.ПолучитьОбъект());
	КонецЦикла;	
	
	Данные = Новый структура();
	Данные.Вставить("МобильноеПриложение",Ложь);
	Данные.Вставить("ОбщиеСправочники",МассивСправочниов);	
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(,Символы.Таб);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, Данные, НазначениеТипаXML.Явное);
	Текст =  ЗаписьJSON.Закрыть();
	
	Возврат Текст
	
КонецФункции

Процедура Восстановить(Текст, Ответ = "") Экспорт
	
	УдалитьДанныеСправочников();
	
	ЧтениеJson = Новый ЧтениеJson;
	ЧтениеJson.УстановитьСтроку(Текст);
	Попытка
		Данные = СериализаторXDTO.ПрочитатьJSON(ЧтениеJson);
	Исключение
		Ответ = "Ошибка чтения файла.";
		Возврат
	КонецПопытки;
		
	Если Данные.Свойство("МобильноеПриложение") Тогда
		Если Данные.МобильноеПриложение Тогда
			Ответ = "Файл выгружен с мобильной версии, все возможные данные будут загружены.";
		КонецЕсли;	
	КонецЕсли;
	
	Если Данные.Свойство("СтильОформления") Тогда
		Константы.СтильОформления.Установить(Данные.СтильОформления);
	КонецЕсли;
	
	Для каждого стр из Данные.ОбщиеСправочники Цикл
		Попытка
			стр.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	ЧтениеJson.Закрыть();
	
КонецПроцедуры

Процедура УдалитьДанныеСправочников()
	
	Выборка = Справочники.БД.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла; 
	
	Выборка = Справочники.ВерсииКонфигураций.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла; 
	
	Выборка = Справочники.ВерсииПлатформы1С.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.Видеорегистраторы.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.ВидыКомплектующих.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.ВидыУстройств.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.Домены.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.Заметки.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.Кассы.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.Клиенты.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.Конфигурации.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.Лицензии.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.Номенклатура.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.ОперационныеСистемы.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.Принтеры.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.Серверы.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.СерверыVPN.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.Сервисы.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.СетевоеОборудование.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.Сети.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.СУБД.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.Устройства.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.УстройстваСУдаленнымУправлением.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.УчетныеДанныеСервисов.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
КонецПроцедуры