
Функция Сохранить() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Серверы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.док_Серверы КАК Серверы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Клиенты.Ссылка
	|ИЗ
	|	Справочник.док_Клиенты КАК Клиенты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.док_Номенклатура КАК Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БД.Ссылка
	|ИЗ
	|	Справочник.док_БД КАК БД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВерсииКонфигураций.Ссылка
	|ИЗ
	|	Справочник.док_ВерсииКонфигураций КАК ВерсииКонфигураций
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВерсииПлатформы1С.Ссылка
	|ИЗ
	|	Справочник.док_ВерсииПлатформы1С КАК ВерсииПлатформы1С
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Видеорегистраторы.Ссылка
	|ИЗ
	|	Справочник.док_Видеорегистраторы КАК Видеорегистраторы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыКомплектующих.Ссылка
	|ИЗ
	|	Справочник.док_ВидыКомплектующих КАК ВидыКомплектующих
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыУстройств.Ссылка
	|ИЗ
	|	Справочник.док_ВидыУстройств КАК ВидыУстройств
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Домены.Ссылка
	|ИЗ
	|	Справочник.док_Домены КАК Домены
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Заметки.Ссылка
	|ИЗ
	|	Справочник.Заметки КАК Заметки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Кассы.Ссылка
	|ИЗ
	|	Справочник.док_Кассы КАК Кассы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Конфигурации.Ссылка
	|ИЗ
	|	Справочник.док_Конфигурации КАК Конфигурации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Лицензии.Ссылка
	|ИЗ
	|	Справочник.док_Лицензии КАК Лицензии
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОперационныеСистемы.Ссылка
	|ИЗ
	|	Справочник.ОперационныеСистемы КАК ОперационныеСистемы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Принтеры.Ссылка
	|ИЗ
	|	Справочник.док_Принтеры КАК Принтеры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СерверыVPN.Ссылка
	|ИЗ
	|	Справочник.док_СерверыVPN КАК СерверыVPN
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Сервисы.Ссылка
	|ИЗ
	|	Справочник.док_Сервисы КАК Сервисы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СетевоеОборудование.Ссылка
	|ИЗ
	|	Справочник.док_СетевоеОборудование КАК СетевоеОборудование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Сети.Ссылка
	|ИЗ
	|	Справочник.док_Сети КАК Сети
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СправочникСУБД.Ссылка
	|ИЗ
	|	Справочник.СУБД КАК СправочникСУБД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Устройства.Ссылка
	|ИЗ
	|	Справочник.док_Устройства КАК Устройства
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УстройстваСУдаленнымУправлением.Ссылка
	|ИЗ
	|	Справочник.док_УстройстваСУдаленнымУправлением КАК УстройстваСУдаленнымУправлением
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УчетныеДанныеСервисов.Ссылка
	|ИЗ
	|	Справочник.док_УчетныеДанныеСервисов КАК УчетныеДанныеСервисов");
	Таб = Запрос.Выполнить().Выгрузить();
	МассивСправочниов = Новый Массив;
	Для каждого стр из Таб Цикл
		МассивСправочниов.Добавить(стр.Ссылка.ПолучитьОбъект());
	КонецЦикла;	
	
	Данные = Новый структура();
	Данные.Вставить("МобильноеПриложение",Ложь);
	Данные.Вставить("ОбщиеСправочники",МассивСправочниов);	
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(,Символы.Таб);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, Данные, НазначениеТипаXML.Явное);
	Текст =  ЗаписьJSON.Закрыть();
	
	Возврат Текст
	
КонецФункции

Процедура Восстановить(Текст, Ответ = "") Экспорт
	
	УдалитьДанныеСправочников();
	
	ЧтениеJson = Новый ЧтениеJson;
	ЧтениеJson.УстановитьСтроку(Текст);
	Попытка
		Данные = СериализаторXDTO.ПрочитатьJSON(ЧтениеJson);
	Исключение
		Ответ = "Ошибка чтения файла.";
		Возврат
	КонецПопытки;
		
	Если Данные.Свойство("МобильноеПриложение") Тогда
		Если Данные.МобильноеПриложение Тогда
			Ответ = "Файл выгружен с мобильной версии, все возможные данные будут загружены.";
		КонецЕсли;	
	КонецЕсли;
	
	Если Данные.Свойство("СтильОформления") Тогда
		Константы.СтильОформления.Установить(Данные.СтильОформления);
	КонецЕсли;
	
	Для каждого стр из Данные.ОбщиеСправочники Цикл
		Попытка
			стр.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	ЧтениеJson.Закрыть();
	
КонецПроцедуры

Процедура УдалитьДанныеСправочников()
	
	Выборка = Справочники.док_БД.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла; 
	
	Выборка = Справочники.док_ВерсииКонфигураций.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла; 
	
	Выборка = Справочники.док_ВерсииПлатформы1С.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.док_Видеорегистраторы.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.док_ВидыКомплектующих.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.док_ВидыУстройств.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.док_Домены.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.Заметки.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.док_Кассы.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.док_Клиенты.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.док_Конфигурации.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.док_Лицензии.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.док_Номенклатура.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.док_ОперационныеСистемы.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.док_Принтеры.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.док_Серверы.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.док_СерверыVPN.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.док_Сервисы.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.док_СетевоеОборудование.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.док_Сети.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.док_СУБД.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.док_Устройства.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.док_УстройстваСУдаленнымУправлением.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
	Выборка = Справочники.док_УчетныеДанныеСервисов.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
КонецПроцедуры