
&НаКлиенте
Процедура СформироватьНаименование(Элемент)
	Объект.Наименование = Строка(Объект.Сервер) + ?(Объект.Порт = "","",":" + СокрЛП(Объект.Порт));	
КонецПроцедуры

&НаКлиенте
Процедура РазрядностьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	ДанныеВыбора = ПолучитьРазрядность();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРазрядность()
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Перечисления.док_Разрядность.x32);
	ДанныеВыбора.Добавить(Перечисления.док_Разрядность.x64);
	Возврат ДанныеВыбора;
КонецФункции
