
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Сканировать();
КонецПроцедуры

&НаКлиенте
Процедура КомандаСканировать(Команда)
	Сканировать();
КонецПроцедуры

&НаКлиенте
Процедура Сканировать()
	#Если МобильноеПриложениеКлиент или МобильныйКлиент Тогда
		ОбработчикСканирования = Новый ОписаниеОповещения("ОбработкаСканирования", ЭтаФорма);
		СредстваМультимедиа.ПоказатьСканированиеШтрихКодов(, ОбработчикСканирования,);
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСканирования(Штрихкод, Результат, Сообщение, ДополнительныеПараметры) Экспорт
	
	#Если МобильноеПриложениеКлиент или МобильныйКлиент Тогда		
		СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();		
	#КонецЕсли
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрНайти(Штрихкод,"e1cib/data/Справочник.док") = 0 Тогда
		ДанныеШтрихкода =  Штрихкод;                                 
	Иначе
		Попытка
			ПерейтиПоНавигационнойСсылке(Штрихкод);
			ЭтаФорма.Закрыть();
		Исключение
			ДанныеШтрихкода =  Штрихкод; 
		КонецПопытки;
	КонецЕсли; 
	
КонецПроцедуры

