
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Контрагент") Тогда
		Контрагент = Параметры.Контрагент;
	КонецЕсли;
	УстановитьПараметрДинамисческогоСписка();
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрДинамисческогоСписка()
	Список.Параметры.УстановитьЗначениеПараметра("Контрагент", Контрагент);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	УстановитьПараметрДинамисческогоСписка();
	ОтборПоКонтрагенту = Контрагент;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	док_СобытияФормКлиент.ПриОткрытии(ЭтаФорма, Отказ);
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Контрагент = ОтборПоКонтрагенту;	
		УстановитьПараметрДинамисческогоСписка();
	КонецЕсли;
КонецПроцедуры