
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Клиент") Тогда
		Клиент = Параметры.Клиент;
	КонецЕсли;
	УстановитьПараметрДинамисческогоСписка();
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрДинамисческогоСписка()
	Список.Параметры.УстановитьЗначениеПараметра("Клиент", Клиент);
КонецПроцедуры

&НаКлиенте
Процедура Клиент1ПриИзменении(Элемент)
	УстановитьПараметрДинамисческогоСписка();
	ОтборПоКлиенту = Клиент;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	док_СобытияФормКлиент.ПриОткрытии(ЭтаФорма, Отказ);
	Если Не ЗначениеЗаполнено(Клиент) Тогда
		Клиент = ОтборПоКлиенту;	
		УстановитьПараметрДинамисческогоСписка();
	КонецЕсли;
КонецПроцедуры