Процедура ОтправитьУведомленияОбОкончанииФН() Экспорт
	
	//Запрос = Новый запрос("ВЫБРАТЬ
	//|	УведомляемыеПользователиОбОкончанииФН.Пользователь КАК Пользователь,
	//|	УведомляемыеПользователиОбОкончанииФН.Email КАК Email,
	//|	УведомляемыеПользователиОбОкончанииФН.Slack КАК Slack
	//|ИЗ
	//|	РегистрСведений.УведомляемыеПользователиОбОкончанииФН КАК УведомляемыеПользователиОбОкончанииФН");
	//ЗапросУведомляемые = Запрос.Выполнить();
	//Если ЗапросУведомляемые.Пустой() Тогда
	//	Возврат;
	//КонецЕсли;	
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//|	КассыФН.Ссылка КАК Ссылка,
	//|	КассыФН.ДатаУстановки КАК ДатаУстановки,
	//|	КассыФН.КоличествоМесяцев КАК КоличествоМесяцев,
	//|	КассыФН.ДатаОкончанияРаботы КАК ДатаОкончанияРаботы,
	//|	КассыФН.Описание КАК Описание
	//|ИЗ
	//|	Справочник.Кассы.ФН КАК КассыФН
	//|ГДЕ
	//|	КассыФН.Заменён = ЛОЖЬ
	//|	И КассыФН.ДатаОкончанияРаботы МЕЖДУ &ДатаНачала И &ДатаКонца");
	//Запрос.УстановитьПараметр("ДатаНачала",ТекущаяДата());
	//Запрос.УстановитьПараметр("ДатаКонца",ТекущаяДата() + 86400*14);
	//
	//ЗапросФН = Запрос.Выполнить();
	//Если ЗапросФН.Пустой() Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//ТабУведомляемые = ЗапросУведомляемые.Выгрузить();
	//МассивТиповКИ = Новый Массив;
	//МассивТиповКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	//МассивТиповКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.Slack);
	//Уведомляемые = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(ТабУведомляемые.ВыгрузитьКолонку("Пользователь"),МассивТиповКИ);
	//ТабФН = ЗапросФН.Выгрузить();
	
	
КонецПРоцедуры	