
&НаКлиенте
Процедура СерверПриИзменении(Элемент)
	Если Объект.Наименование = "" Тогда
		СформироватьНаименование();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаименование()
	Объект.Наименование = Объект.Сервер.Наименование + " (" + Объект.Сервер.Клиент.Наименование + ")";	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТипСУБД()
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Перечисления.док_ТипБД.MS_SQL);
	ДанныеВыбора.Добавить(Перечисления.док_ТипБД.PostgreSQL);
	ДанныеВыбора.Добавить(Перечисления.док_ТипБД.Oracle);
	ДанныеВыбора.Добавить(Перечисления.док_ТипБД.IBM_DB2);
	Возврат ДанныеВыбора;
КонецФункции

&НаКлиенте
Процедура СУБДТипНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)	
	СтандартнаяОбработка = Ложь;	
	ДанныеВыбора = ТипСУБД();		
КонецПроцедуры
