
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ТипДанных") Тогда
		ТипДанных = Новый ОписаниеТипов("СправочникСсылка." + Параметры.ТипДанных);
		ЭтаФорма.Заголовок = Параметры.ТипДанных;
		СЗ.ТипЗначения = ТипДанных;
		СЗ.ЗагрузитьЗначения(Параметры.Данные);
		Конфигурация = Параметры.Конфигурация;
	Иначе	
		Возврат
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СЗВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТД = Элементы.СЗ.ТекущиеДанные;
	СтандартнаяОбработка = Ложь;
	ВЗнач = ТД.Значение;
	Если ВвестиЗначение(ВЗнач, "", ТипДанных) Тогда
		ТД.Значение	= ВЗнач;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтроку(Команда)
	ВЗнач = Неопределено; 
	ЗначениеОтбора = Новый Структура("Конфигурация", Конфигурация);
	ПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);
	ОткрытьФорму("Справочник.док_ВерсииКонфигураций.ФормаВыбора",ПараметрыВыбора,,,,,Новый ОписаниеОповещения("ПолучениеЗначенияПослеВыбора",ЭтаФорма));
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	ЭтаФорма.Закрыть(СЗ.ВыгрузитьЗначения());
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеЗначенияПослеВыбора(ВыбранноеЗначение, Парам2) Экспорт 	
	Если НЕ ВыбранноеЗначение = Неопределено Тогда
		Сз.Добавить(ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры