
&НаКлиенте
Процедура СерверПриИзменении(Элемент)
	Если Объект.Наименование = "" Тогда
		СформироватьНаименование();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаименование()
	Объект.Наименование = Объект.Сервер.Наименование + " (" + Объект.Сервер.Клиент.Наименование + ")";	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТипСУБД()
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Перечисления.ТипБД.MS_SQL);
	ДанныеВыбора.Добавить(Перечисления.ТипБД.PostgreSQL);
	ДанныеВыбора.Добавить(Перечисления.ТипБД.Oracle);
	ДанныеВыбора.Добавить(Перечисления.ТипБД.IBM_DB2);
	Возврат ДанныеВыбора;
КонецФункции

&НаКлиенте
Процедура СУБДТипНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = ТипСУБД();	
	
КонецПроцедуры
