
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	ВставитьВерсии1С();
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьКоманду();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьКоманду()
	
	Команда = "regsvr32 " + ?(Разрядность = "x32",  """C:\Program Files (x86)\1cv8\", """C:\Program Files\1cv8\") + Версия1С + "\bin\comcntr.dll""";
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Если ОбщегоНазначенияКлиент.ЭтоWindowsКлиент() Тогда	
		Разрядность = ?(СистемнаяИнформация.ТипПлатформы = Типплатформы.Windows_x86_64,"x64","x32");
	КонецЕсли;
	НайденноеЗначение = Элементы.Версия1С.СписокВыбора.НайтиПоЗначению(СистемнаяИнформация.ВерсияПриложения);
	Если НЕ НайденноеЗначение = Неопределено Тогда		
		Версия1С = НайденноеЗначение.Значение;             		
	КонецЕсли;
	СформироватьКоманду();
	
	#Если ВебКлиент или МобильныйКлиент Тогда
		Элементы.Команда.КнопкаОткрытия = Ложь;
	#КонецЕсли
	
КонецПроцедуры

&НаСервере
Процедура ВставитьВерсии1С()

	Запрос = Новый запрос("ВЫБРАТЬ
	|	док_ВерсииПлатформы1С.Наименование КАК Наименование
	|ИЗ
	|	Справочник.док_ВерсииПлатформы1С КАК док_ВерсииПлатформы1С
	|
	|УПОРЯДОЧИТЬ ПО
	|	док_ВерсииПлатформы1С.ДатаВыхода УБЫВ");
	Таб = Запрос.Выполнить().Выгрузить();
	Элементы.Версия1С.СписокВыбора.ЗагрузитьЗначения(Таб.ВыгрузитьКолонку("Наименование"));
	
КонецПроцедуры	

&НаКлиенте
Процедура КомандаОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(Команда);
КонецПроцедуры
