//NNS

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КоличествоПаролей = 1;
	ДлинаПароля = 8;
	БуквыНижнийРегистр = Истина;
	БуквыВерхнийРегистр = Истина;
	ИспЦифры = Истина;
	ИспСпецСимволы = Истина;
	СпецСимволы = "_.,!?@#$%^&*()+|\/№;:-=~[]";
КонецПроцедуры

&НаКлиенте
Процедура Генерация(Команда)
	
	Если БуквыНижнийРегистр Тогда
		БуквыСтрочные = "abcdefghiklmnopqrstvxyz";
	Иначе	
		БуквыСтрочные = "";
	КонецЕсли;	
	Если БуквыВерхнийРегистр Тогда
		БуквыЗаглавные = "ABCDEFGHIKLMNOPQRSTVXYZ";
	Иначе	
		БуквыЗаглавные = "";
	КонецЕсли;	
	Если ИспЦифры Тогда
		Цифры = "0123456789";
	Иначе	
		Цифры = "";
	КонецЕсли;	
	Если ИспСпецСимволы Тогда
		СпСм = СпецСимволы;
	Иначе	
		СпСм = "";
	КонецЕсли;
	
	ВсяСтрока = Цифры + БуквыЗаглавные + БуквыСтрочные + СпСм;
	Вгр = 0;
	Нгр = 0;
	ПолучитьВерхнююИНижнююГраницуСимволов(ВсяСтрока, Вгр, Нгр);
	
	Для Номер = 1 По КоличествоПаролей Цикл
		ГенерируемыеПароли.Добавить(ГенерацияПароля(ВсяСтрока, Вгр, Нгр));
	КонецЦикла;	
	        
КонецПроцедуры

&НаСервере
Функция ГенерацияПароля(ВсяСтрока, Вгр, Нгр)
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	ГенПароль = "";
	Пока СтрДлина(ГенПароль) < ДлинаПароля Цикл
		НекийСимвол = Символ(ГСЧ.СлучайноеЧисло(Нгр, Вгр));			
		Если Найти(НеиспользуемыеСимволы, НекийСимвол) > 0 ИЛИ НЕ Найти(ВсяСтрока, НекийСимвол) > 0 Тогда
			Продолжить;
		КонецЕсли;
		ГенПароль = ГенПароль + НекийСимвол;
	КонецЦикла;
	Возврат ГенПароль
КонецФункции

&НаСервере
Процедура ПолучитьВерхнююИНижнююГраницуСимволов(ВсяСтрока, Вгр, Нгр)
	Для НомерСимвола = 1 По СтрДлина(ВсяСтрока) Цикл
		Символ = Сред(ВсяСтрока, НомерСимвола, 1);		
		Если НомерСимвола = 1 Тогда
			Вгр = КодСимвола(Символ);
			Нгр = КодСимвола(Символ);
		КонецЕсли;
		Если Вгр < КодСимвола(Символ) Тогда
			Вгр = КодСимвола(Символ);
		КонецЕсли;
		Если Нгр > КодСимвола(Символ) Тогда
			Нгр = КодСимвола(Символ);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
