
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимостьХоста(); 
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	УстановитьВидимостьХоста();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьХоста()
	//Элементы.Хост.Видимость = Объект.Тип = Перечисления.ТипСервера.ВиртуальнаяМашина;
	Элементы.Родитель.Видимость = Объект.Тип = Перечисления.ТипСервера.ВиртуальнаяМашина;
	Элементы.Поколение.Видимость = Объект.Тип = Перечисления.ТипСервера.ВиртуальнаяМашина;
КонецПроцедуры

&НаКлиенте
Процедура ДоменПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьЭлементов()
	
	Элементы.Доменные.Видимость = НЕ Объект.Домен.Пустая();
	Элементы.КонтроллерДомена.Видимость = НЕ Объект.Домен.Пустая();
	ДоменныеПользователи.Параметры.УстановитьЗначениеПараметра("Ссылка",объект.Домен);	  
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если Объект.Тип = Перечисления.ТипСервера.ВиртуальнаяМашина И Объект.Родитель.Пустая() Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Не заполнен хост виртуальной машины.'");
		Сообщение.Поле = "Родитель";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура IPОсновнойПриИзменении(Элемент)
	Строка = Элементы.IP.ТекущиеДанные;
	IPОсновнойПриИзмененииНаСервере();
	Строка.Основной = Истина;
КонецПроцедуры

&НаСервере
Процедура IPОсновнойПриИзмененииНаСервере()
	Для каждого стр из объект.IP цикл
		стр.Основной = Ложь;
	КонецЦикла;		
КонецПроцедуры
