
Процедура УстановкаПараметровСеанса() Экспорт
		
	Если Пользователи.ЭтоПолноправныйПользователь(,,Ложь) Тогда
		ПараметрыСеанса.док_ИспользоватьОграничениеRLSПоКонтрагентам = Ложь;
	Иначе
		Если ПолучитьФункциональнуюОпцию("док_ИспользоватьОграничениеRLS_ПоКлиентам") Тогда
			Пользователь = Пользователи.ТекущийПользователь();
			ПараметрыСеанса.док_ИспользоватьОграничениеRLSПоКонтрагентам = ИспользоватьОграничениеRLS_ПоКлиентам(Пользователь);
			ПараметрыСеанса.док_РазрешенныеКонтрагенты = Новый ФиксированныйМассив(ПолучитьРазрешенныхКлиентовПользователя(Пользователь)); 
		КонецЕсли;
	КонецЕсли;
	
	#Если НЕ ВнешнееСоединение Тогда
		ТекущийСтиль = док_ОбщегоНазначения.ПолучитьНастройкуПользователя(Пользователи.ТекущийПользователь(),"Стиль");			
		Если НЕ ТекущийСтиль = "" Тогда
			Попытка
				ГлавныйСтиль = БиблиотекаСтилей[ТекущийСтиль];
			Исключение
				ПодробнаяИнформацияОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ТекстОшибки = СтрШаблон("Не удалось установить главный стиль ""%1"" по причине:
				|%2",
				ТекущийСтиль,
				ПодробнаяИнформацияОбОшибке);
				ЗаписьЖурналаРегистрации(
				"Установка главного стиля приложения",
				УровеньЖурналаРегистрации.Предупреждение,
				,,
				ТекстОшибки);
			КонецПопытки;	 
		КонецЕсли;
		
		ИмяПользователя = ИмяПользователя();	
		МасштабФорм = док_ОбщегоНазначения.ПолучитьНастройкуПользователя(Пользователи.ТекущийПользователь(),"МасштабФорм");
		Если НЕ МасштабФорм = "" Тогда 
			НастройкиКлиентскогоПриложения = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиКлиентскогоПриложения",,,ИмяПользователя);
			Если НЕ НастройкиКлиентскогоПриложения = Неопределено Тогда
				НастройкиКлиентскогоПриложения.ВариантМасштабаФормКлиентскогоПриложения = ВариантМасштабаФормКлиентскогоПриложения[МасштабФорм];
				ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиКлиентскогоПриложения", "", НастройкиКлиентскогоПриложения, , ИмяПользователя);
			КонецЕсли;
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

Функция ПолучитьРазрешенныхКлиентовПользователя(Пользователь)
	
	Запрос = Новый запрос("ВЫБРАТЬ
	|	док_РазрешенныеКонтрагентыПользователейКонтрагенты.Контрагент КАК Контрагент
	|ИЗ
	|	Справочник.док_РазрешенныеКонтрагентыПользователей.Контрагенты КАК док_РазрешенныеКонтрагентыПользователейКонтрагенты
	|ГДЕ
	|	док_РазрешенныеКонтрагентыПользователейКонтрагенты.Ссылка.Пользователь = &Пользователь");
	Запрос.УстановитьПараметр("Пользователь",Пользователь);
	Таб = Запрос.Выполнить().Выгрузить();
	Возврат Таб.ВыгрузитьКолонку("Контрагент");
	
КонецФункции	

Функция ИспользоватьОграничениеRLS_ПоКлиентам(Пользователь)
	
	Запрос = Новый запрос("ВЫБРАТЬ
	|	док_РазрешенныеКонтрагентыПользователей.ИспользоватьОграничение КАК ИспользоватьОграничение
	|ИЗ
	|	Справочник.док_РазрешенныеКонтрагентыПользователей КАК док_РазрешенныеКонтрагентыПользователей
	|ГДЕ
	|	док_РазрешенныеКонтрагентыПользователей.Пользователь = &Пользователь");
	Запрос.УстановитьПараметр("Пользователь",Пользователь);
	ЗВ = Запрос.Выполнить();
	Если ЗВ.Пустой() Тогда
		Возврат Ложь;
	Иначе	
		Таб = ЗВ.Выгрузить();
		Возврат Таб[0].ИспользоватьОграничение;
	КонецЕсли;
	
КонецФункции  
