
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	ВставитьВерсии1С();	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьКоманду();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьКоманду()
	
	Команда = "regsvr32 " + ?(Разрядность = "x32",  """C:\Program Files (x86)\1cv8\", """C:\Program Files\1cv8\") + Версия1С + "\bin\comcntr.dll""";
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Если ОбщегоНазначенияКлиент.ЭтоWindowsКлиент() Тогда	
		Разрядность = ?(СистемнаяИнформация.ТипПлатформы = Типплатформы.Windows_x86_64,"x64","x32");
	КонецЕсли;
	НайденноеЗначение = Элементы.Версия1С.СписокВыбора.НайтиПоЗначению(СистемнаяИнформация.ВерсияПриложения);
	Если НЕ НайденноеЗначение = Неопределено Тогда		
		Версия1С = НайденноеЗначение.Значение;             		
	КонецЕсли;
	СформироватьКоманду();
	
КонецПроцедуры

Процедура ВставитьВерсии1С()
	
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.20.1674");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.19.1467");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.18.1741");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.20.1613");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.19.1417");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.18.1698");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.20.1590");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.19.1399");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.19.1351");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.18.1661");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.20.1549");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.19.1264");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.18.1616");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.19.1229");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.19.1150");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.18.1563");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.17.2306");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.18.1520");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.17.2256");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.18.1483");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.16.1973");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.17.2231");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.17.2171");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.18.1363");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.18.1334");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.17.1989");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.18.1289");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.16.1876");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.18.1208");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.17.1851");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.16.1814");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.18.1201");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.16.1810");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.17.1846");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.17.1823");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.16.1791");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.15.2107");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.18.1128");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.17.1549");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.16.1659");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.17.1496");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.15.1985");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.16.1502");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.17.1386");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.15.1958");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.14.2095");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.16.1359");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.16.1296");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.16.1224");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.16.1148");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.15.1869");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.16.1063");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.15.1830");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.15.1778");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.14.1993");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.16.1030");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.15.1747");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.14.1976");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.15.1700");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.15.1656");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.14.1944");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.15.1565");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.13.1926");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.15.1534");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.15.1489");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.14.1854");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.12.1924");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.14.1779");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.14.1694");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.13.1865");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.14.1630");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.13.1809");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.12.1855");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.14.1565");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.13.1690");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.13.1644");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.12.1790");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.13.1513");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.12.1714");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.12.1685");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.12.1616");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.12.1595");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.12.1567");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.12.1529");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.12.1469");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.12.1440");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.11.3133");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.10.2772");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.12.1412");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.11.3034");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.10.2753");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.11.2954");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.11.2924");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.11.2899");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.10.2699");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.11.2867");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.10.2667");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.10.2650");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.10.2639");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.10.2580");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.10.2561");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.9.2309");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.8.2442");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.10.2505");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.10.2466");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.10.2375");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.10.2299");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.10.2252");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.9.2233");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.9.2170");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.9.2033");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.8.2322");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.9.1850");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.8.2197");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.9.1818");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.8.2167");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.8.2137");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.8.2088");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.8.2054");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.8.2027");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.8.1964");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.8.1933");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.8.1861");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.8.1784");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.8.1747");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.8.1675");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.8.1652");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.7.2027");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.6.2530");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.7.2008");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.6.2524");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.7.1993");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.7.1970");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.7.1949");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.7.1917");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.7.1901");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.7.1873");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.7.1860");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.7.1845");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.7.1831");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.7.1805");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.7.1790");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.6.2449");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.7.1776");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.6.2421");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.7.1759");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.6.2390");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.6.2363");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.6.2332");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.6.2299");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.6.2237");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.6.2152");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.5.1625");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.6.2100");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.5.1596");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.6.2076");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.6.2041");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.6.2014");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.6.1999");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.5.1570");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.6.1977");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.5.1517");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.5.1486");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.5.1482");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.5.1460");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.5.1443");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.5.1428");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.5.1383");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.5.1248");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.5.1231");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.5.1186");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.5.1146");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.5.1119");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.5.1098");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.5.1088");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.5.1068");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.4.496");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.4.482");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.4.465");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.4.437");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.4.408");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.4.389");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.4.365");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.3.721");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.3.715");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.3.687");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.3.658");
	Элементы.Версия1С.СписокВыбора.Добавить("8.3.3.641");
	
КонецПроцедуры	

&НаКлиенте
Процедура КомандаОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(Команда);
КонецПроцедуры
