
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВидимостьТипПодключения();
КонецПроцедуры

&НаСервере
Процедура ВидимостьТипПодключения()
	Элементы.IP.Видимость = Объект.ТипПодключения = Перечисления.док_ТипПодключения.Сетевой;
КонецПроцедуры

&НаКлиенте
Процедура ТипПодключенияПриИзменении(Элемент)
	ВидимостьТипПодключения();
КонецПроцедуры

&НаКлиенте
Процедура ФНДатаУстановкиПриИзменении(Элемент)
	РассчитатьДатуОкончанияФН();
КонецПроцедуры

&НаКлиенте
Процедура ФНКоличествоМесяцевПриИзменении(Элемент)
	РассчитатьДатуОкончанияФН();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьДатуОкончанияФН()
	строка = Элементы.ФН.ТекущиеДанные;
	строка.ДатаОкончанияРаботы = ДобавитьМесяц(строка.ДатаУстановки,строка.КоличествоМесяцев);
КонецПроцедуры

&НаКлиенте
Процедура НазначитьНаименование(Элемент)
	Объект.Наименование = "" + Объект.Модель + " (" + Объект.Клиент + ")";
КонецПроцедуры
