Процедура ЗаполнитьЗначенияЗаполненияПриСозданииНаСервере(Объект,ЗначенияЗаполнения) Экспорт
	Для каждого стрктр из ЗначенияЗаполнения Цикл
		Объект[стрктр.Ключ] = стрктр.Значение;
	КонецЦикла;	
КонецПроцедуры	

Функция ПолучитьЗначениеКонстанты(Константа) Экспорт
	Возврат Константы[Константа].Получить();
КонецФункции	

Функция ПолучитьНастройкуПользователя(Объект, Настройка) Экспорт
	
	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("Настройка", ?(ТипЗнч(Настройка) = Тип("Строка"),ПланыВидовХарактеристик.ПраваИНастройки[Настройка],Настройка));
	Запрос.УстановитьПараметр("Объект", Объект);	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Значение
	|ИЗ
	|	РегистрСведений.НастройкиПользователей
	|
	|ГДЕ
	|	Объект = &Объект
	|	И Настройка  = &Настройка";
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПустоеЗначение = ?(ТипЗнч(Настройка) = Тип("Строка"),ПланыВидовХарактеристик.ПраваИНастройки[Настройка],Настройка).ТипЗначения.ПривестиЗначение();
	
	Если Выборка.Количество() = 0 Тогда		
		Возврат ПустоеЗначение;	
	ИначеЕсли Выборка.Следующий() Тогда		
		Если НЕ ЗначениеЗаполнено(Выборка.Значение) Тогда
			Возврат ПустоеЗначение;
		Иначе
			Возврат Выборка.Значение;
		КонецЕсли;		
	Иначе
		Возврат ПустоеЗначение;		
	КонецЕсли;
	
КонецФункции

