
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьНастройкиСхем();
	
	Элементы.Стиль.СписокВыбора.Добавить(
		"ПоУмолчанию",
		"<По умолчанию>");
	
	Для каждого метаСтиль Из Метаданные.Стили Цикл
		Если Не СтрНайти(метаСтиль.Имя, "СтильОформления") Тогда
			Продолжить;
		КонецЕсли; 
		Элементы.Стиль.СписокВыбора.Добавить(
			метаСтиль.Имя,
			метаСтиль.Синоним);
	КонецЦикла; 	
	
	ТекущийСтиль = ХранилищеОбщихНастроек.Загрузить(
		"СтильОформления",
		"Стиль");
	
	Если ТекущийСтиль = Неопределено Тогда
		 Стиль = "ПоУмолчанию";
	 Иначе
		 Стиль = ТекущийСтиль;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Перезапустить(Команда)

	СохранитьСхему();
	
	ЗавершитьРаботуСистемы(Ложь, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	СохранитьСхему();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура СохранитьСхему()
	
	Если Стиль = "ПоУмолчанию" Тогда
		ИмяСтиля = Неопределено;
	Иначе
		ИмяСтиля = Стиль;
	КонецЕсли; 
	
	ХранилищеОбщихНастроек.Сохранить(
		"СтильОформления",
		"Стиль",
		ИмяСтиля,,);
	
КонецПроцедуры

&НаКлиенте
Процедура СхемаПриИзменении(Элемент)
	
	ИмяКартинки = СтилиКартинки.НайтиСтроки(Новый Структура("ИмяСтиля", Стиль))[0].ИмяКартинки;	
	Элементы.Предпросмотр.Картинка = БиблиотекаКартинок[ИмяКартинки];
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СхемаПриИзменении(Неопределено);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиСхем()
	
	Настройка = СтилиКартинки.Добавить();
	Настройка.ИмяСтиля = "ПоУмолчанию";
	Настройка.ИмяКартинки = "СтильОформления_ПоУмолчанию";
	
	Настройка = СтилиКартинки.Добавить();
	Настройка.ИмяСтиля = "СтильОформленияЗеленый";
	Настройка.ИмяКартинки = "СтильОформленияЗеленый";
	
	Настройка = СтилиКартинки.Добавить();
	Настройка.ИмяСтиля = "СтильОформленияСиний";
	Настройка.ИмяКартинки = "СтильОформленияСиний";
	
	Настройка = СтилиКартинки.Добавить();
	Настройка.ИмяСтиля = "СтильОформленияРозовый";
	Настройка.ИмяКартинки = "СтильОформленияРозовый";	
	
	Настройка = СтилиКартинки.Добавить();
	Настройка.ИмяСтиля = "СтильОформленияСерый";
	Настройка.ИмяКартинки = "СтильОформленияСерый"; 
	
	Настройка = СтилиКартинки.Добавить();
	Настройка.ИмяСтиля = "СтильОформленияТемноСерый";
	Настройка.ИмяКартинки = "СтильОформленияТемноСерый";
	
	Настройка = СтилиКартинки.Добавить();
	Настройка.ИмяСтиля = "СтильОформленияТемный";
	Настройка.ИмяКартинки = "СтильОформленияТемный";

КонецПроцедуры
