
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьПараметрДинамисческогоСписка();	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	док_СобытияФормКлиент.ПриОткрытии(ЭтаФорма, Отказ);
	Если ЭтаФорма.Окно = Неопределено Тогда 
		Контрагент = ОтборПоКонтрагенту;
		УстановитьПараметрДинамисческогоСписка();
	Иначе
		ЭтаФорма.ОтображатьЗаголовок  = Ложь;
		Элементы.Контрагент.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрДинамисческогоСписка()
	Список.Параметры.УстановитьЗначениеПараметра("Контрагент", Контрагент);
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	УстановитьПараметрДинамисческогоСписка();
	ОтборПоКонтрагенту = Контрагент;
КонецПроцедуры

