
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВыводитьКлинета = Истина;
	Если Параметры.Свойство("СсылкаНаОбъект") Тогда
		СсылкаНаОбъект = Параметры.СсылкаНаОбъект;
		СгенерироватьНаСервере();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)	
	Результат.Напечатать(РежимИспользованияДиалогаПечати.Использовать);	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьШтрихкод(Команда)
	ОчиститьСообщения();
	СгенерироватьНаСервере();
КонецПроцедуры
       
&НаСервере
Процедура СгенерироватьНаСервере()
	
	Результат.Очистить();
	
	ВремОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ВремОбъект.ПолучитьМакет("Макет");
	
	Область = Макет.ПолучитьОбласть("Строка|Колонка");
	Рисунок = Область.Рисунки.ШтрихКод;
	
	Эталон = ВремОбъект.ПолучитьМакет("МакетДляОпределенияКоэффициентовЕдиницИзмерения");
	
	КоличествоМиллиметровВПикселеВысота = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
	КоличествоМиллиметровВПикселеШирина = Эталон.Рисунки.Квадрат100Пикселей.Ширина / 100;
	ШиринаШтрихкода = Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселеШирина);
	ВысотаШтрихкода = Окр(Рисунок.Высота / КоличествоМиллиметровВПикселеВысота);

	ВходныеДанные = ПолучитьНавигационнуюСсылку(СсылкаНаОбъект);
		
	Картинка = ПолучитьШтрихкод(ШиринаШтрихкода, ВысотаШтрихкода, ВходныеДанные, 16);
	
	Рисунок.Картинка = Картинка;
	Результат.Вывести(Область);
	
	ОбластьПодписьУстройство = Макет.ПолучитьОбласть("ПодписьУстройство");
	ОбластьПодписьУстройство.Параметры.Устройство = Строка(ТипЗнч(СсылкаНаОбъект)) + ": " + Строка(СсылкаНаОбъект) + ?(ВыводитьКлинета, " (" + Строка(СсылкаНаОбъект.Клиент) + ")","");
	Результат.Вывести(ОбластьПодписьУстройство);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьШтрихкод(ШиринаШтрихкода, ВысотаШтрихкода, ЗначШтрихкод, ЗначТипШтрихкода)
	
	ПараметрыШтрихкода = ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
	ПараметрыШтрихкода.Ширина = ШиринаШтрихкода;
	ПараметрыШтрихкода.Высота = ВысотаШтрихкода;
	ПараметрыШтрихкода.ТипКода = ЗначТипШтрихкода;
	//ПараметрыШтрихкода.УголПоворота = Число(УголПоворота);
	ПараметрыШтрихкода.Штрихкод = ЗначШтрихкод;
	ПараметрыШтрихкода.ПрозрачныйФон = Истина;
	//ПараметрыШтрихкода.УровеньКоррекцииQR = УровеньКоррекцииQR;
	//ПараметрыШтрихкода.ОтображатьТекст = ОтображатьТекст;
	//ПараметрыШтрихкода.Масштабировать = Масштабировать;
	ПараметрыШтрихкода.СохранятьПропорции = Истина;
	//ПараметрыШтрихкода.ВертикальноеВыравнивание  = ВертикальноеВыравнивание; 
	//ПараметрыШтрихкода.GS1DatabarКоличествоСтрок = КоличествоСтрокGS1Databar;
	ПараметрыШтрихкода.ТипВходныхДанных = 0;
	//ПараметрыШтрихкода.УбратьЛишнийФон = УбратьЛишнийФон;
	//ПараметрыШтрихкода.ЛоготипКартинка = КартинкаBase64;
	//ПараметрыШтрихкода.ЛоготипРазмерПроцентОтШК = ЛоготипРазмерПроцентОтШК;
	
	РезультатШтрихкод = ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШтрихкода);
	Если НЕ РезультатШтрихкод.Результат Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Ошибка генерации'"));
	КонецЕсли;
	
	Возврат РезультатШтрихкод.Картинка;
	
КонецФункции