
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТекущийВариантИнтерфейсаКлиентскогоПриложения() = ВариантИнтерфейсаКлиентскогоПриложения.Версия8_2 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Внимание! Параметры внешнего вида можно менять только в интерфейсе Такси.");
		Отказ = Истина;
	Иначе
				
		Элементы.Стиль.СписокВыбора.Добавить("ПоУмолчанию", "Жёлтый");
		
		Для каждого метСтиль Из Метаданные.Стили Цикл
			Если Не СтрНайти(метСтиль.Имя, "СтильОформления") Тогда
				Продолжить;
			КонецЕсли; 
			Элементы.Стиль.СписокВыбора.Добавить(метСтиль.Имя,метСтиль.Синоним);
		КонецЦикла; 	
		
		ТекущийСтиль = док_ОбщегоНазначения.ПолучитьНастройкуПользователя(Пользователи.ТекущийПользователь(),"Стиль");		
		Если ТекущийСтиль = "" Тогда
			Стиль = "ПоУмолчанию";
		Иначе
			Стиль = ТекущийСтиль;
		КонецЕсли; 
				
		ТекущийМасштаб = док_ОбщегоНазначения.ПолучитьНастройкуПользователя(Пользователи.ТекущийПользователь(),"МасштабФорм");		
		Если ТекущийМасштаб = "" Тогда
			МасштабФорм = "Обычный";
		Иначе
			МасштабФорм = ТекущийМасштаб;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Перезапустить(Команда)
	
	СохранитьСхему();
	
	ЗавершитьРаботуСистемы(Ложь, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	СохранитьСхему();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура СохранитьСхему()
	
	Если Стиль = "ПоУмолчанию" Тогда
		ИмяСтиля = "";
	Иначе
		ИмяСтиля = Стиль;
	КонецЕсли; 
	
	док_ОбщегоНазначения.УстановитьНастройкуПользователя(Пользователи.ТекущийПользователь(),"Стиль",ИмяСтиля);
	док_ОбщегоНазначения.УстановитьНастройкуПользователя(Пользователи.ТекущийПользователь(),"МасштабФорм",МасштабФорм);
	
КонецПроцедуры
