
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьПараметрДинамисческогоСписка();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СобытияФормКлиент.ПриОткрытии(ЭтаФорма, Отказ);
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрДинамисческогоСписка()
	Список.Параметры.УстановитьЗначениеПараметра("Клиент", Клиент);
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	УстановитьПараметрДинамисческогоСписка();
	ОтборПоКлиенту = Клиент;
КонецПроцедуры

