
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьПараметрДинамисческогоСписка();	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	док_СобытияФормКлиент.ПриОткрытии(ЭтаФорма, Отказ);
	Если ЭтаФорма.Окно = Неопределено Тогда 
		Клиент = ОтборПоКлиенту;
		УстановитьПараметрДинамисческогоСписка();
	Иначе
		ЭтаФорма.ОтображатьЗаголовок  = Ложь;
		Элементы.Клиент.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрДинамисческогоСписка()
	Список.Параметры.УстановитьЗначениеПараметра("Клиент", Клиент);
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	УстановитьПараметрДинамисческогоСписка();
	ОтборПоКлиенту = Клиент;
КонецПроцедуры

