
&НаКлиенте
Процедура ПолучитьСписокБаз(Команда)
	ПолучитьСписокБазНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокБазНаСервере()
	БД.Очистить();
	
	Соединитель = Новый COMObject("V83.COMConnector");	
	 
	СтрокаСоединения = "TCP://" + АдресСервера + ":" + Порт;
	Попытка	
		СоединениеСАгентом = Соединитель.ConnectAgent(СтрокаСоединения);
	Исключение
		Сообщить("Ошибка " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	МассивКластеров = СоединениеСАгентом.GetClusters();
	
	// получается первый массив кластера.
	ОписаниеКластера = МассивКластеров.GetValue(МассивКластеров.GetLowerBound());
	
	// в случае если определены администраторы кластера, должны быть указаны данные о логине.
	СоединениеСАгентом.authenticate(ОписаниеКластера, " ", " ");
	
	МассивБаз = СоединениеСАгентом.GetInfoBases(ОписаниеКластера);
	МаксимальныйИндекс = МассивБаз.GetUpperBound();
	
	Для ТекущийИндекс = МассивБаз.GetLowerBound() По МаксимальныйИндекс Цикл
		ОписаниеБазы = МассивБаз.GetValue(ТекущийИндекс);
		Стр = БД.Добавить();
		Стр.ИБ = ОписаниеБазы.Name;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Порт = "1540";
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СУБД_.Наименование КАК СерверСУБД,
	|	СУБД_.Сервер.IP.(
	|		IP КАК СерверIP
	|	) КАК СерверIP
	|ИЗ
	|	Справочник.док_СУБД КАК СУБД_");
	Таб = Запрос.Выполнить().Выгрузить();
	Для каждого стр из Таб Цикл
		Для каждого стрIP из стр.СерверIP Цикл
			Элементы.АдресСервера.СписокВыбора.Добавить(стрIP.СерверIP,стр.СерверСУБД + " (" + стрIP.СерверIP + ")");
		КонецЦикла;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнформациюНаСервере()
	Для каждого стрБД из БД Цикл
		Для каждого стрУД из УчетныеДанные Цикл
			Попытка
				Подкл = Новый COMОбъект("V83.COMConnector");
				COMОбъект = Подкл.Connect("Srvr=""" + АдресСервера + """;Ref=""" + стрБД.ИБ + """;Usr=""" + стрУД.Логин + """;Pwd=""" + стрУД.Пароль + """");
				Прервать;
			Исключение
				Сообщить(ОписаниеОшибки());
				Продолжить;
				//Возврат;
			КонецПопытки;  
		КонецЦикла;
		Попытка
			стрБД.ПодробнаяИнформация = Строка(COMОбъект.Метаданные.BriefInformation);
			стрБД.Версия = Строка(COMОбъект.Метаданные.Version);
		Исключение
			Сообщить(ОписаниеОшибки());
			Продолжить;	
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИнформацию(Команда)
	ЗаполнитьИнформациюНаСервере();
КонецПроцедуры
