
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТипБДСервер();	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидимостьWebСервер();
КонецПроцедуры   

&НаКлиенте
Процедура ТипБДПриИзменении(Элемент)
	ТипБДСервер();
КонецПроцедуры

&НаСервере
Процедура ТипБДСервер()	
	Если НЕ Объект.ТипБД.Пустая() Тогда 
		Элементы.ИмяИБ.Видимость = НЕ Объект.ТипБД = Перечисления.док_ТипБД.Файловая;
		Элементы.ПутьК_БД.Видимость = Объект.ТипБД = Перечисления.док_ТипБД.Файловая;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОпубликованаНаWebСервереПриИзменении(Элемент)
	ВидимостьWebСервер();
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьWebСервер()	
	Элементы.WebСервер.Видимость = Объект.ОпубликованаНаWebСервере;
	Элементы.АдресПубликации.Видимость = Объект.ОпубликованаНаWebСервере;
КонецПроцедуры

&НаКлиенте
Процедура СУБДПриИзменении(Элемент)
	СУБДПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СУБДПриИзмененииНаСервере()
	Объект.Клиент = Объект.СУБД.Сервер.Клиент;
КонецПроцедуры


