
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	УстановитьПараметрДинамисческогоСписка();
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрДинамисческогоСписка()
	Список.Параметры.УстановитьЗначениеПараметра("Контрагент", Контрагент);
КонецПроцедуры

&НаКлиенте
Процедура Клиент1ПриИзменении(Элемент)
	УстановитьПараметрДинамисческогоСписка();
	ОтборПоКонтрагенту = Контрагент;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	док_СобытияФормКлиент.ПриОткрытии(ЭтаФорма, Отказ);
	Контрагент = ОтборПоКонтрагенту;	
	УстановитьПараметрДинамисческогоСписка();
КонецПроцедуры
