
Процедура ПерезаполнитьПрограммыУдаленногоУправленияВ_УстройствахСУУ() Экспорт
			
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	док_УстройстваСУдаленнымУправлением.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.док_УстройстваСУдаленнымУправлением КАК док_УстройстваСУдаленнымУправлением
	|ГДЕ
	|	НЕ док_УстройстваСУдаленнымУправлением.удалить_Программа = ЗНАЧЕНИЕ(Перечисление.удалить_док_ПрограммыУдаленногоУправления.ПустаяСсылка)");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Об = Выборка.Ссылка.ПолучитьОбъект();
		Попытка
			Об.Программа = Справочники.док_ПрограммыУдаленногоУправления[ОбщегоНазначения.ИмяЗначенияПеречисления(Об.удалить_Программа)];
			Об.удалить_Программа = Перечисления.удалить_док_ПрограммыУдаленногоУправления.ПустаяСсылка();
			Об.Записать();
		Исключение КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры	
