Процедура ПерезаполнитьТипБД_В_БД() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый запрос("ВЫБРАТЬ
	|	док_БД.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.док_БД КАК док_БД
	|ГДЕ
	|	НЕ док_БД.ТипБД = ЗНАЧЕНИЕ(Перечисление.док_ТипБД.Файловая)
	|	И НЕ док_БД.ТипБД = ЗНАЧЕНИЕ(Перечисление.док_ТипБД.КлиентСерверная)");
	ТабБД = Запрос.Выполнить().Выгрузить();
	Для каждого стрБД из ТабБД Цикл
		ОбБД = стрБД.Ссылка.ПолучитьОбъект();
		ОбБД.ТипБД = Перечисления.док_ТипБД.КлиентСерверная;
		ОбБД.Записать();
	КонецЦикла;
	
КонецПроцедуры


