//
Процедура УстановитьКлиентаВ_БД_ПоДаннымСервера() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый запрос("ВЫБРАТЬ
	|	док_БД.Ссылка КАК Ссылка,
	|	док_БД.СУБД.Сервер.Контрагент КАК Контрагент
	|ИЗ
	|	Справочник.док_БД КАК док_БД");
	ТаблицаБД = Запрос.Выполнить().Выгрузить();
	Для каждого БД Из ТаблицаБД Цикл
		ОбъектБД = БД.Ссылка.ПолучитьОбъект();
		ОбъектБД.Контрагент = БД.Контрагент;
		ОбъектБД.Записать();
	КонецЦикла;	
	
КонецПроцедуры

//
Процедура СоздатьСУБД_ПоДаннымКластера1С() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый запрос("ВЫБРАТЬ
	|	Кластеры1С_СУБД.Ссылка.Наименование КАК Наименование,
	|	Кластеры1С_СУБД.Ссылка.Сервер КАК Сервер,
	|	Кластеры1С_СУБД.Тип КАК Тип,
	|	Кластеры1С_СУБД.Версия КАК Версия,
	|	Кластеры1С_СУБД.Логин КАК Логин,
	|	Кластеры1С_СУБД.Пароль КАК Пароль,
	|	Кластеры1С_СУБД.ПарольЗашифрован КАК ПарольЗашифрован,
	|	Кластеры1С_СУБД.ПользовательОС КАК ПользовательОС
	|ИЗ
	|	Справочник.док_Кластеры1С.СУБД КАК Кластеры1С_СУБД");
	ТаблицаКластер = Запрос.Выполнить().Выгрузить();
	Для каждого Кл Из ТаблицаКластер Цикл
		СправочникСУБД = Справочники.док_СУБД.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(СправочникСУБД,Кл);
		СправочникСУБД.Записать();
	КонецЦикла;	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	док_БД.Ссылка КАК Ссылка,
	|	док_БД.Сервер КАК Сервер,
	|	док_СУБД.Ссылка КАК СУБД
	|ИЗ
	|	Справочник.док_БД КАК док_БД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.док_СУБД КАК док_СУБД
	|		ПО док_БД.Сервер.Наименование = док_СУБД.Наименование
	|			И док_БД.ТипБД = док_СУБД.Тип
	|ГДЕ
	|	НЕ док_БД.ТипБД = &ТипБД");
	Запрос.УстановитьПараметр("ТипБД",Перечисления.док_ТипБД.Файловая);
	ТабБД = Запрос.Выполнить().Выгрузить();
	Для каждого БД Из ТабБД Цикл
		ОбъектБД = БД.Ссылка.ПолучитьОбъект();
		ОбъектБД.СУБД = БД.СУБД;
		ОбъектБД.Записать();
	КонецЦикла;
	
КонецПроцедуры

//
Процедура ЗаполнитьИмяИБ_В_СУБД_ИмяИБ() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый запрос("ВЫБРАТЬ
	|	док_БД.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.док_БД КАК док_БД
	|ГДЕ
	|	НЕ док_БД.ТипБД = &ТипБД");
	Запрос.УстановитьПараметр("ТипБД",Перечисления.док_ТипБД.Файловая);
	ТабБД = Запрос.Выполнить().Выгрузить();
	Для каждого стрБД из ТабБД Цикл
		ОбБД = СтрБД.Ссылка.ПолучитьОбъект();
		ОбБД.ИмяИБ_В_СУБД = ОбБД.ИмяИБ;
		ОбБД.Записать();
	КонецЦикла;
	
КонецПроцедуры