Процедура ЗаполнитьВерсииКонфигурации() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый запрос("ВЫБРАТЬ
	|	док_ВерсииКонфигураций.Ссылка КАК Ссылка,
	|	док_ВерсииКонфигураций.ОбновлениеДляВерсий.(
	|		Версия.Наименование КАК Версия
	|	) КАК ОбновлениеДляВерсий
	|ИЗ
	|	Справочник.док_ВерсииКонфигураций КАК док_ВерсииКонфигураций");
	ТабКонф = Запрос.Выполнить().Выгрузить();
	Для каждого стрКонф из ТабКонф Цикл
		ОбКонф = стрКонф.Ссылка.ПолучитьОбъект();
		ВерсииКонф = "";
		Для каждого стр из стрКонф.ОбновлениеДляВерсий Цикл
			ВерсииКонф = ВерсииКонф + ?(ВерсииКонф = "","",", ") + стр.Версия;
		КонецЦикла;	
		ОбКонф.ОбновлениеДляВерсийСтрока = ВерсииКонф;
		ОбКонф.Записать();
	КонецЦикла;
	
КонецПроцедуры


